erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСкладСырье/СХК_МобильныйСкладСырье.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСкладСырье</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабПриемка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/Documents/ПриобретениеТоваровУслуг/ПриобретениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриобретениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f3631163-ecf9-4949-af6b-b3c894a40c91">
    <name>ДопоступлениеПоДокументу</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a272903-ac15-4c54-83f5-b82f1b6b646d">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="941aa10e-3657-48ec-8f9d-92e38e90ecbf">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8838bcd9-5b8b-43a2-af1e-aa9708955035">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="422786fa-18ea-4f26-8dd6-4a588060e399">
      <name>ЗаказПоставщику</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2a1df39c-cbfc-404b-9562-a5843f5ff91e">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="fe8e86bc-a667-4a44-bce5-642d9aeae84c">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0cc415ea-d44d-4d76-bb55-6a68970d24dd">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСкладСырье/Forms/ФормаУПД/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	Если ЗначениеЗаполнено(СтруктураПараметров.ЗаказПоставщику) Тогда
		ДокументЗаказПоставщику = СтруктураПараметров.ЗаказПоставщику;
		ДатаУПД =  ДокументЗаказПоставщику.Ссылка.ЖелаемаяДатаПоступления;
	Иначе
		Сообщить("Не удалось создать документ отгрузки");	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Элементы.НомерУПД.РедактированиеТекста = Истина;
	АктивироватьПолеНомерУПД();

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПолеНомерУПД() 
	ОчиститьПолеНомерУПД(); 
	Элементы.НомерУПД.ОбновитьТекстРедактирования();
	Элементы.НомерУПД.Видимость = Ложь;
	Элементы.НомерУПД.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.НомерУПД; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьПолеНомерУПД()
	НомерУПД = "";
КонецПроцедуры

&НаКлиенте
Процедура Поступление(Команда)
	Ош = ПроверитьПоля();
	Если Ош = Ложь Тогда   
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Значение) Экспорт 
					
КонецПроцедуры




&НаСервере
Функция ПроверитьПоля()
	Если СтрДлина(СокрЛП(НомерУПД)) = 0 Тогда
		Возврат "Заполните номер УПД";
	Иначе
		Если Не ПроверитьУПД(НомерУПД) Тогда
			Возврат "Такой номер уже существует";
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции


&НаСервере
Функция ПроверитьУПД(Номер)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	               |ГДЕ
	               |	ПриобретениеТоваровУслуг.НомерВходящегоДокумента = &НомерВходящегоДокумента
	               |	И ПриобретениеТоваровУслуг.ЗаказПоставщику = &ЗаказПоставщику
	               |	И ПриобретениеТоваровУслуг.ПометкаУдаления = Ложь"; 
	Запрос.УстановитьПараметр("ЗаказПоставщику",ДокументЗаказПоставщику.Ссылка);
	Запрос.УстановитьПараметр("НомерВходящегоДокумента",Номер);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() ТОгда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции



&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	//СписокЗаказПоставщикуНаСервере();	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("ДатаУПД",ЭтаФорма.ДатаУПД);
	СтуктураВозврат.Вставить("НомерУПД",ЭтаФорма.НомерУПД);
	ОповеститьОВыборе(СтуктураВозврат); 

КонецПроцедуры
